src/cfe/InformationRegisters/кбп_ПереходыСхем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кбп_ПереходыСхем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Откуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Куда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУсловия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ВидыУсловий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбработчикУсловия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ОбработчикиПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдКнопки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУсловия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ВерсииСхем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдПерехода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/кбп_ИсполнителиШагов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кбп_ИсполнителиШагов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособАдресации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_СпособыАдресации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьОбъектаАдресации1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьОбъектаАдресации2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ОбработчикиПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Шаг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/кбп_КнопкиШагов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кбп_КнопкиШагов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ВидыКнопок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подтверждение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстПодтверждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийОбязателен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ВидыДействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдПерехода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОбработчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кбп_ВидыОбработчиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ОбработчикиПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВложеннаяСхема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_СхемыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УсловиеВидимости</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦепочкаДействий</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Шаг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.кбп_ЭлементыСхем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдКнопки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Enums/кбп_СтатусыВерсийСхем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_СтатусыВерсийСхем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опубликована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_ТипыШагов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_ТипыШагов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вариант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Таймер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оповещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декорация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_РежимыСлияния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_РежимыСлияния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Все</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Любая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NизM</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_ДействияПриПросрочке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_ДействияПриПросрочке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ничего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Эскалация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автовыполнение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_ВидыУсловий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кбп_ВидыУсловий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выражение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_СпособыАдресации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_СпособыАдресации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Роль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительПредыдущегоШага</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзРеквизита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбираетПредыдущий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Enums/кбп_ВидыКнопок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>кбп_ВидыКнопок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Основная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опасная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/CommonModules/кбп_КомпиляторСхем/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ГрафическаяСхема

// Проставляет элементам графической схемы неизменяемые имена вида "ид" + GUID без дефисов.
// Имя меняется, если оно не такого вида (новый элемент) или повторяется (копирование и вставка).
//
// Параметры:
//  ГрафСхема - ГрафическаяСхема
//
// Возвращаемое значение:
//  Соответствие - старое имя → новое имя для переименованных элементов.
//
Функция ПрисвоитьИдентификаторы(ГрафСхема) Экспорт

	Переименования = Новый Соответствие;
	Занятые = Новый Соответствие;
	Для Каждого Элемент Из ГрафСхема.ЭлементыГрафическойСхемы Цикл
		Вид = ВидЭлемента(Элемент);
		Если Вид = "Декорация" Или Вид = "" Тогда
			// Оформление (прямоугольник, текст, картинка) в модель не входит, у части таких элементов имя только для чтения.
			Продолжить;
		КонецЕсли;
		Имя = Элемент.Имя;
		Если Не ЭтоИдентификаторЭлемента(Имя) Или Занятые[Имя] <> Неопределено Тогда
			НовоеИмя = НовыйИдентификаторЭлемента();
			Попытка
				Элемент.Имя = НовоеИмя;
			Исключение
				Продолжить;
			КонецПопытки;
			Переименования.Вставить(Имя, НовоеИмя);
		КонецЕсли;
		Занятые.Вставить(Элемент.Имя, Истина);
	КонецЦикла;
	Возврат Переименования;

КонецФункции

// Разбирает графическую схему в модель: шаги и переходы.
//
// Параметры:
//  ГрафСхема - ГрафическаяСхема - имена элементов уже проставлены (ПрисвоитьИдентификаторы).
//
// Возвращаемое значение:
//  Структура:
//   * Шаги - Массив из Структура - Ид, Наименование, Вид (строка вида элемента), ИдВыбора, ЗначениеВарианта;
//   * Переходы - Массив из Структура - Ид, Наименование, ИдОткуда, ИдКуда, ИдВарианта, ВыходУсловия;
//   * Ошибки - Массив из Структура - Ид, Текст.
//
Функция РазобратьСхему(ГрафСхема) Экспорт

	Модель = Новый Структура("Шаги, Переходы, Ошибки", Новый Массив, Новый Массив, Новый Массив);

	Для Каждого Элемент Из ГрафСхема.ЭлементыГрафическойСхемы Цикл

		Вид = ВидЭлемента(Элемент);
		Если Вид = "Декорация" Или Вид = "" Тогда
			// Элементы неизвестных видов считаются оформлением (их тип виден в «Структуре схемы»).
			Продолжить;

		ИначеЕсли Вид = "Линия" Тогда
			Модель.Переходы.Добавить(ОписаниеПерехода(Элемент, Модель.Ошибки));

		Иначе
			Шаг = НовыйШаг(Элемент.Имя, Строка(Элемент.Наименование), Вид);
			Модель.Шаги.Добавить(Шаг);
			Если Вид = "ВыборВарианта" Тогда
				Для Каждого Вариант Из ВариантыВыбора(Элемент) Цикл
					ШагВарианта = НовыйШаг(ИдВарианта(Элемент.Имя, Вариант.Значение), Строка(Вариант.Наименование), "Вариант");
					ШагВарианта.ИдВыбора = Элемент.Имя;
					ШагВарианта.ЗначениеВарианта = Строка(Вариант.Значение);
					Модель.Шаги.Добавить(ШагВарианта);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Возврат Модель;

КонецФункции

// Диагностика API графической схемы: виды элементов и значения свойств, которые удалось прочитать.
// Нужна на этапе 0, чтобы подтвердить свойства линий и выходов «Условия» на конкретной версии платформы.
//
// Параметры:
//  ГрафСхема - ГрафическаяСхема
//
// Возвращаемое значение:
//  Строка
//
Функция СтруктураСхемы(ГрафСхема) Экспорт

	Кандидаты = "Имя, Наименование, Значение, Подсказка, НачалоЭлемент, КонецЭлемент, НачалоВариант, КонецВариант,
		|ВидЛинии, СторонаНачала, СторонаКонца, НачалоСторона, КонецСторона, ВыходИстина, ВыходЛожь,
		|Лево, Верх, Ширина, Высота, ТипПерехода, ПорядокВыхода";
	Кандидаты = СтрЗаменить(Кандидаты, Символы.ПС, "");

	Строки = Новый Массив;
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Строки.Добавить(СтрШаблон(НСтр("ru = 'Версия платформы: %1'"), СистемнаяИнформация.ВерсияПриложения));
	Для Каждого Элемент Из ГрафСхема.ЭлементыГрафическойСхемы Цикл
		Строки.Добавить("");
		Строки.Добавить(СтрШаблон("[%1] вид «%2»", ТипЗнч(Элемент), ВидЭлемента(Элемент)));
		Свойства = Новый Структура(Кандидаты);
		ЗаполнитьЗначенияСвойств(Свойства, Элемент);
		Для Каждого КлючЗначение Из Свойства Цикл
			Если КлючЗначение.Значение = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Значение = КлючЗначение.Значение;
			Представление = Строка(Значение);
			Попытка
				Представление = Значение.Имя + " (" + ТипЗнч(Значение) + ")";
			Исключение
				Представление = Представление + " (" + ТипЗнч(Значение) + ")";
			КонецПопытки;
			Строки.Добавить(СтрШаблон("   %1 = %2", КлючЗначение.Ключ, Представление));
		КонецЦикла;
		Если ВидЭлемента(Элемент) = "ВыборВарианта" Тогда
			Для Каждого Вариант Из ВариантыВыбора(Элемент) Цикл
				Строки.Добавить(СтрШаблон("   вариант: Значение = %1 (%2), Наименование = %3",
					Вариант.Значение, ТипЗнч(Вариант.Значение), Вариант.Наименование));
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Возврат СтрСоединить(Строки, Символы.ПС);

КонецФункции

#КонецОбласти

#Область ВерсииСхем

// Графическая схема версии (новая пустая, если не сохранена).
//
// Параметры:
//  Версия - СправочникСсылка.кбп_ВерсииСхем
//
// Возвращаемое значение:
//  ГрафическаяСхема
//
Функция ГрафическаяСхемаВерсии(Версия) Экспорт

	Если ЗначениеЗаполнено(Версия) Тогда
		Хранилище = Версия.ГрафическаяСхема;
		Если Хранилище <> Неопределено Тогда
			ГрафСхема = Хранилище.Получить();
			Если ТипЗнч(ГрафСхема) = Тип("ГрафическаяСхема") Тогда
				Возврат ГрафСхема;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Новый ГрафическаяСхема;

КонецФункции

// Версия для открытия в конструкторе: черновик, если есть, иначе текущая опубликованная.
//
// Параметры:
//  Схема - СправочникСсылка.кбп_СхемыПроцессов
//
// Возвращаемое значение:
//  СправочникСсылка.кбп_ВерсииСхем
//
Функция ВерсияДляРедактирования(Схема) Экспорт

	Если Не ЗначениеЗаполнено(Схема) Тогда
		Возврат Справочники.кбп_ВерсииСхем.ПустаяСсылка();
	КонецЕсли;
	Если ЗначениеЗаполнено(Схема.Черновик) Тогда
		Возврат Схема.Черновик;
	ИначеЕсли ЗначениеЗаполнено(Схема.ТекущаяВерсия) Тогда
		Возврат Схема.ТекущаяВерсия;
	КонецЕсли;
	Возврат СоздатьЧерновик(Схема);

КонецФункции

// Возвращает черновик схемы; если его нет — создаёт копированием текущей опубликованной версии
// (или пустую первую версию).
//
// Параметры:
//  Схема - СправочникСсылка.кбп_СхемыПроцессов
//
// Возвращаемое значение:
//  СправочникСсылка.кбп_ВерсииСхем
//
Функция СоздатьЧерновик(Схема) Экспорт

	НачатьТранзакцию();
	Попытка
		ЗаблокироватьСхему(Схема);
		СхемаОбъект = Схема.ПолучитьОбъект();
		Если ЗначениеЗаполнено(СхемаОбъект.Черновик) Тогда
			ЗафиксироватьТранзакцию();
			Возврат СхемаОбъект.Черновик;
		КонецЕсли;

		Основание = СхемаОбъект.ТекущаяВерсия;
		НомерВерсии = СледующийНомерВерсии(Схема);

		ВерсияОбъект = Справочники.кбп_ВерсииСхем.СоздатьЭлемент();
		ВерсияОбъект.Владелец = Схема;
		ВерсияОбъект.НомерВерсии = НомерВерсии;
		ВерсияОбъект.Наименование = СтрШаблон(НСтр("ru = 'Версия %1'"), НомерВерсии);
		ВерсияОбъект.Статус = Перечисления.кбп_СтатусыВерсийСхем.Черновик;
		ВерсияОбъект.Автор = кбп_АдаптерКонфигурации.ТекущийПользователь();
		ВерсияОбъект.ДатаСоздания = ТекущаяДатаСеанса();
		ВерсияОбъект.ВерсияОснование = Основание;
		Если ЗначениеЗаполнено(Основание) Тогда
			ВерсияОбъект.ГрафическаяСхема = Новый ХранилищеЗначения(ГрафическаяСхемаВерсии(Основание), Новый СжатиеДанных(9));
		КонецЕсли;
		ВерсияОбъект.Записать();

		Если ЗначениеЗаполнено(Основание) Тогда
			КопироватьНастройкиВерсии(Основание, ВерсияОбъект.Ссылка);
		КонецЕсли;

		СхемаОбъект.Черновик = ВерсияОбъект.Ссылка;
		СхемаОбъект.Записать();

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат ВерсияОбъект.Ссылка;

КонецФункции

// Сохраняет графическую схему черновика и синхронизирует с ней справочник элементов и регистр переходов.
// Связь — по неизменяемому ИдЭлемента (= Имя элемента схемы). Настройки существующих шагов и переходов сохраняются.
//
// Параметры:
//  Версия - СправочникСсылка.кбп_ВерсииСхем - черновик.
//  ГрафСхема - ГрафическаяСхема - имена проставляются здесь же.
//
// Возвращаемое значение:
//  Структура:
//   * Переименования - Соответствие - старое имя элемента схемы → новое.
//   * Ошибки - Массив из Структура - Ид, Текст.
//
Функция СохранитьЧерновик(Версия, ГрафСхема) Экспорт

	ПроверитьЧерновик(Версия);

	Результат = Новый Структура;
	Результат.Вставить("Переименования", ПрисвоитьИдентификаторы(ГрафСхема));
	Модель = РазобратьСхему(ГрафСхема);
	Результат.Вставить("Ошибки", Модель.Ошибки);

	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("Справочник.кбп_ВерсииСхем").УстановитьЗначение("Ссылка", Версия);
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.кбп_ПереходыСхем");
		ЭлементБлокировки.УстановитьЗначение("Версия", Версия);
		Блокировка.Заблокировать();

		ВерсияОбъект = Версия.ПолучитьОбъект();
		ВерсияОбъект.ГрафическаяСхема = Новый ХранилищеЗначения(ГрафСхема, Новый СжатиеДанных(9));
		ВерсияОбъект.Записать();

		ЭлементыПоИд = СинхронизироватьЭлементы(Версия, Модель.Шаги);
		СинхронизироватьПереходы(Версия, Модель.Переходы, ЭлементыПоИд, Результат.Ошибки);

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Проверка версии перед публикацией (ФТ-105).
//
// Параметры:
//  Версия - СправочникСсылка.кбп_ВерсииСхем
//
// Возвращаемое значение:
//  Массив из Структура - Ид (ИдЭлемента или ИдПерехода), Текст.
//
Функция ПроверитьВерсию(Версия) Экспорт

	Ошибки = Новый Массив;
	Шаги = ШагиВерсии(Версия);
	Переходы = ПереходыВерсии(Версия);

	Типы = Перечисления.кбп_ТипыШагов;
	Узлы = Новый Соответствие;       // Ссылка → строка шага
	Исходящие = Новый Соответствие;  // Ссылка → Массив ссылок
	Входящие = Новый Соответствие;
	ИсходящиеВарианта = Новый Соответствие; // вариант → количество линий
	Старты = Новый Массив;
	Завершения = Новый Массив;

	Для Каждого Шаг Из Шаги Цикл
		Если Шаг.ТипШага = Типы.Вариант Тогда
			ИсходящиеВарианта.Вставить(Шаг.Ссылка, 0);
			Продолжить;
		КонецЕсли;
		Узлы.Вставить(Шаг.Ссылка, Шаг);
		Исходящие.Вставить(Шаг.Ссылка, Новый Массив);
		Входящие.Вставить(Шаг.Ссылка, Новый Массив);
		Если Шаг.ТипШага = Типы.Старт Тогда
			Старты.Добавить(Шаг.Ссылка);
		ИначеЕсли Шаг.ТипШага = Типы.Завершение Тогда
			Завершения.Добавить(Шаг.Ссылка);
		КонецЕсли;
	КонецЦикла;

	ИсходящиеБезВозвратов = Новый Соответствие;
	Для Каждого КлючЗначение Из Исходящие Цикл
		ИсходящиеБезВозвратов.Вставить(КлючЗначение.Ключ, Новый Массив);
	КонецЦикла;
	ЗаголовкиКнопок = ЗаголовкиКнопокВерсии(Версия);

	Для Каждого Переход Из Переходы Цикл
		Если Исходящие[Переход.Откуда] = Неопределено Или Входящие[Переход.Куда] = Неопределено Тогда
			ДобавитьОшибку(Ошибки, Переход.ИдПерехода, НСтр("ru = 'Линия не соединяет два шага схемы'"));
			Продолжить;
		КонецЕсли;
		Исходящие[Переход.Откуда].Добавить(Переход.Куда);
		Входящие[Переход.Куда].Добавить(Переход.Откуда);
		Если Не Переход.ЭтоВозврат Тогда
			ИсходящиеБезВозвратов[Переход.Откуда].Добавить(Переход.Куда);
		КонецЕсли;
		Если ЗначениеЗаполнено(Переход.Вариант) И ИсходящиеВарианта[Переход.Вариант] <> Неопределено Тогда
			ИсходящиеВарианта[Переход.Вариант] = ИсходящиеВарианта[Переход.Вариант] + 1;
		КонецЕсли;
	КонецЦикла;

	Если Старты.Количество() <> 1 Тогда
		ДобавитьОшибку(Ошибки, "", СтрШаблон(НСтр("ru = 'На схеме должен быть ровно один Старт (сейчас %1)'"), Старты.Количество()));
	КонецЕсли;
	Если Завершения.Количество() = 0 Тогда
		ДобавитьОшибку(Ошибки, "", НСтр("ru = 'На схеме нет Завершения'"));
	КонецЕсли;

	// Шаги, которые нужны на этапе 1–2, и требования к числу веток.
	Для Каждого КлючЗначение Из Узлы Цикл
		Шаг = КлючЗначение.Значение;
		ЧислоВыходов = Исходящие[Шаг.Ссылка].Количество();
		ЧислоВходов = Входящие[Шаг.Ссылка].Количество();
		Ид = Шаг.ИдЭлемента;
		Имя = Шаг.Наименование;

		Если Шаг.ТипШага = Типы.Старт Тогда
			Если ЧислоВходов > 0 Тогда
				ДобавитьОшибку(Ошибки, Ид, НСтр("ru = 'В Старт не должно входить линий'"));
			КонецЕсли;
		ИначеЕсли ЧислоВходов = 0 Тогда
			ДобавитьОшибку(Ошибки, Ид, СтрШаблон(НСтр("ru = '«%1»: нет входящих линий'"), Имя));
		КонецЕсли;

		Если Шаг.ТипШага = Типы.Завершение Тогда
			Если ЧислоВыходов > 0 Тогда
				ДобавитьОшибку(Ошибки, Ид, СтрШаблон(НСтр("ru = '«%1»: из Завершения не должно выходить линий'"), Имя));
			КонецЕсли;
		ИначеЕсли Шаг.ТипШага <> Типы.ВыборВарианта И ЧислоВыходов = 0 Тогда
			ДобавитьОшибку(Ошибки, Ид, СтрШаблон(НСтр("ru = '«%1»: нет исходящих линий'"), Имя));
		КонецЕсли;

		Если Шаг.ТипШага = Типы.Задача Тогда
			ПроверитьКнопки(Шаг, Ошибки);
		КонецЕсли;
		Если Шаг.ТипШага = Типы.Условие Тогда
			ПроверитьУсловие(Шаг, Переходы, Ошибки, ЗаголовкиКнопок);
		ИначеЕсли Шаг.ТипШага = Типы.ВыборВарианта Тогда
			ПроверитьВыборВарианта(Шаг, Переходы, Ошибки, ЗаголовкиКнопок);
		ИначеЕсли Шаг.ТипШага = Типы.Разделение И ЧислоВыходов < 2 Тогда
			ДобавитьОшибку(Ошибки, Ид, СтрШаблон(НСтр("ru = '«%1»: у Разделения должно быть не меньше двух веток'"), Имя));
		ИначеЕсли Шаг.ТипШага = Типы.Разделение Тогда
			ПроверитьПарностьРазделения(Шаг, Узлы, ИсходящиеБезВозвратов, Ошибки);
		ИначеЕсли Шаг.ТипШага = Типы.Слияние И ЧислоВходов < 2 Тогда
			ДобавитьОшибку(Ошибки, Ид, СтрШаблон(НСтр("ru = '«%1»: в Слияние должны входить не меньше двух веток'"), Имя));
		ИначеЕсли Шаг.ТипШага = Типы.Слияние И Шаг.РежимСлияния = Перечисления.кбп_РежимыСлияния.NизM
			И (Шаг.КоличествоДляСлияния < 1 Или Шаг.КоличествоДляСлияния > ЧислоВходов) Тогда
			ДобавитьОшибку(Ошибки, Ид, СтрШаблон(
				НСтр("ru = '«%1»: для режима «N из M» укажите N от 1 до %2 (число входящих веток)'"), Имя, ЧислоВходов));
		ИначеЕсли Шаг.ТипШага = Типы.Задача И Не Шаг.ЕстьИсполнители Тогда
			ДобавитьОшибку(Ошибки, Ид, СтрШаблон(НСтр("ru = '«%1»: не заданы исполнители (для способов «Пользователь», «Роль», «Из реквизита», «Обработчик» заполните значение)'"), Имя));
		ИначеЕсли Шаг.ТипШага = Типы.Задача И Шаг.ДействиеПриПросрочке <> Перечисления.кбп_ДействияПриПросрочке.Ничего
			И ЗначениеЗаполнено(Шаг.ДействиеПриПросрочке) И Шаг.СрокЗначение = 0 И Не ЗначениеЗаполнено(Шаг.СрокИзПеременной) Тогда
			ДобавитьОшибку(Ошибки, Ид, СтрШаблон(
				НСтр("ru = '«%1»: задано действие при просрочке, но не задан срок задачи'"), Имя));
		ИначеЕсли Шаг.ТипШага = Типы.Задача И ЧислоВыходов > 1 Тогда
			ПроверитьВыходыПоКнопкам(Шаг, Переходы, Ошибки);
		ИначеЕсли Шаг.ТипШага = Типы.Таймер И Шаг.ТаймерЗначение = 0 И Не ЗначениеЗаполнено(Шаг.ТаймерИзПеременной) Тогда
			ДобавитьОшибку(Ошибки, Ид, СтрШаблон(НСтр("ru = '«%1»: у таймера не задано время ожидания'"), Имя));
		ИначеЕсли Шаг.ТипШага = Типы.ВложенныйПроцесс Тогда
			ПроверитьВложенныйПроцесс(Шаг, Версия, Ошибки);
		КонецЕсли;
	КонецЦикла;

	// Условия на линиях: вид условия выбран, а само условие не задано.
	Для Каждого Переход Из Переходы Цикл
		Если Переход.ВидУсловия = Перечисления.кбп_ВидыУсловий.Отбор И Не кбп_Условия.УсловиеЗаполнено(Переход.Условие) Тогда
			ДобавитьОшибку(Ошибки, Переход.ИдПерехода, СтрШаблон(
				НСтр("ru = 'Линия «%1 → %2»: условие не настроено (кнопка «Настроить условие»)'"), Переход.Откуда, Переход.Куда));
		ИначеЕсли Переход.ВидУсловия = Перечисления.кбп_ВидыУсловий.Обработчик И Не ЗначениеЗаполнено(Переход.ОбработчикУсловия) Тогда
			ДобавитьОшибку(Ошибки, Переход.ИдПерехода, СтрШаблон(
				НСтр("ru = 'Линия «%1 → %2»: не выбран обработчик условия'"), Переход.Откуда, Переход.Куда));
		КонецЕсли;
	КонецЦикла;

	Для Каждого Шаг Из Шаги Цикл
		Если Шаг.ТипШага = Типы.Вариант И ИсходящиеВарианта[Шаг.Ссылка] <> 1 Тогда
			ДобавитьОшибку(Ошибки, Шаг.ИдЭлемента, СтрШаблон(
				НСтр("ru = 'Из варианта «%1» должна выходить ровно одна линия (сейчас %2)'"),
				Шаг.Наименование, ИсходящиеВарианта[Шаг.Ссылка]));
		КонецЕсли;
	КонецЦикла;

	// Достижимость от Старта и путь к Завершению (ФТ-105).
	Если Старты.Количество() = 1 Тогда
		Достижимые = ОбходГрафа(Старты, Исходящие);
		Для Каждого КлючЗначение Из Узлы Цикл
			Если Достижимые[КлючЗначение.Ключ] = Неопределено Тогда
				ДобавитьОшибку(Ошибки, КлючЗначение.Значение.ИдЭлемента, СтрШаблон(
					НСтр("ru = '«%1»: шаг недостижим от Старта'"), КлючЗначение.Значение.Наименование));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Завершения.Количество() > 0 Тогда
		ВедутКЗавершению = ОбходГрафа(Завершения, Входящие);
		Для Каждого КлючЗначение Из Узлы Цикл
			Если ВедутКЗавершению[КлючЗначение.Ключ] = Неопределено Тогда
				ДобавитьОшибку(Ошибки, КлючЗначение.Значение.ИдЭлемента, СтрШаблон(
					НСтр("ru = '«%1»: от шага нет пути к Завершению'"), КлючЗначение.Значение.Наименование));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат Ошибки;

КонецФункции

// Публикует черновик: проверка, смена статуса, текущая версия схемы (АР-4).
//
// Параметры:
//  Версия - СправочникСсылка.кбп_ВерсииСхем
//
// Возвращаемое значение:
//  Массив из Структура - ошибки проверки; пустой — версия опубликована.
//
Функция Опубликовать(Версия) Экспорт

	ПроверитьЧерновик(Версия);
	Если Не кбп_Лицензирование.ДоступноДействие("ПубликацияСхемы") Тогда
		ВызватьИсключение НСтр("ru = 'Публикация схем недоступна по условиям лицензии.'");
	КонецЕсли;

	Ошибки = ПроверитьВерсию(Версия);
	Если Ошибки.Количество() > 0 Тогда
		Возврат Ошибки;
	КонецЕсли;

	Схема = Версия.Владелец;
	НачатьТранзакцию();
	Попытка
		ЗаблокироватьСхему(Схема);
		СхемаОбъект = Схема.ПолучитьОбъект();

		Если ЗначениеЗаполнено(СхемаОбъект.ТекущаяВерсия) Тогда
			Прежняя = СхемаОбъект.ТекущаяВерсия.ПолучитьОбъект();
			Прежняя.Статус = Перечисления.кбп_СтатусыВерсийСхем.Архив;
			Прежняя.Записать();
		КонецЕсли;

		ВерсияОбъект = Версия.ПолучитьОбъект();
		ВерсияОбъект.Статус = Перечисления.кбп_СтатусыВерсийСхем.Опубликована;
		ВерсияОбъект.ДатаПубликации = ТекущаяДатаСеанса();
		ВерсияОбъект.Опубликовал = кбп_АдаптерКонфигурации.ТекущийПользователь();
		ВерсияОбъект.Записать();

		СхемаОбъект.ТекущаяВерсия = Версия;
		СхемаОбъект.Черновик = Справочники.кбп_ВерсииСхем.ПустаяСсылка();
		СхемаОбъект.Записать();

		кбп_ПроцессыСлужебный.ОбновитьПравилаЗапуска(Схема);

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат Ошибки;

КонецФункции

// Элемент справочника или ключ записи перехода по имени элемента схемы — для открытия свойств.
//
// Параметры:
//  Версия - СправочникСсылка.кбп_ВерсииСхем
//  Ид - Строка - Имя элемента графической схемы.
//
// Возвращаемое значение:
//  СправочникСсылка.кбп_ЭлементыСхем, РегистрСведенийКлючЗаписи.кбп_ПереходыСхем, Неопределено
//
Функция ОбъектПоИдЭлемента(Версия, Ид) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("Ид", Ид);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Элементы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.кбп_ЭлементыСхем КАК Элементы
	|ГДЕ
	|	Элементы.Владелец = &Версия
	|	И Элементы.ИдЭлемента = &Ид
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Переходы.ИдПерехода КАК ИдПерехода
	|ИЗ
	|	РегистрСведений.кбп_ПереходыСхем КАК Переходы
	|ГДЕ
	|	Переходы.Версия = &Версия
	|	И Переходы.ИдПерехода = &Ид";
	Результаты = Запрос.ВыполнитьПакет();

	Выборка = Результаты[0].Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Если Не Результаты[1].Пустой() Тогда
		Возврат РегистрыСведений.кбп_ПереходыСхем.СоздатьКлючЗаписи(
			Новый Структура("Версия, ИдПерехода", Версия, Ид));
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

// Шаги версии для списка в конструкторе и для проверки.
//
// Параметры:
//  Версия - СправочникСсылка.кбп_ВерсииСхем
//
// Возвращаемое значение:
//  ТаблицаЗначений - Ссылка, ИдЭлемента, Наименование, ТипШага, ВложеннаяСхема, ЕстьИсполнители.
//
Функция ШагиВерсии(Версия) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Элементы.Ссылка КАК Ссылка,
	|	Элементы.ИдЭлемента КАК ИдЭлемента,
	|	Элементы.Наименование КАК Наименование,
	|	Элементы.ТипШага КАК ТипШага,
	|	Элементы.ВложеннаяСхема КАК ВложеннаяСхема,
	|	Элементы.ВложеннаяВерсия КАК ВложеннаяВерсия,
	|	Элементы.РежимСлияния КАК РежимСлияния,
	|	Элементы.КоличествоДляСлияния КАК КоличествоДляСлияния,
	|	Элементы.ТаймерЗначение КАК ТаймерЗначение,
	|	Элементы.ТаймерИзПеременной КАК ТаймерИзПеременной,
	|	Элементы.СрокЗначение КАК СрокЗначение,
	|	Элементы.СрокИзПеременной КАК СрокИзПеременной,
	|	Элементы.ДействиеПриПросрочке КАК ДействиеПриПросрочке,
	|	Элементы.МножественныйЗапуск КАК МножественныйЗапуск,
	|	Элементы.ИсточникМножественногоЗапуска КАК ИсточникМножественногоЗапуска,
	|	ВЫБОР
	|		КОГДА ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					РегистрСведений.кбп_ИсполнителиШагов КАК Исполнители
	|				ГДЕ
	|					Исполнители.Шаг = Элементы.Ссылка
	|					И ВЫБОР
	|							КОГДА Исполнители.СпособАдресации = ЗНАЧЕНИЕ(Перечисление.кбп_СпособыАдресации.Пользователь)
	|								ТОГДА Исполнители.Пользователь <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|							КОГДА Исполнители.СпособАдресации = ЗНАЧЕНИЕ(Перечисление.кбп_СпособыАдресации.Роль)
	|								ТОГДА Исполнители.Роль <> ЗНАЧЕНИЕ(Справочник.кбп_РолиИсполнителей.ПустаяСсылка)
	|							КОГДА Исполнители.СпособАдресации = ЗНАЧЕНИЕ(Перечисление.кбп_СпособыАдресации.ИзРеквизита)
	|								ТОГДА Исполнители.РеквизитПредмета <> """"
	|							КОГДА Исполнители.СпособАдресации = ЗНАЧЕНИЕ(Перечисление.кбп_СпособыАдресации.Обработчик)
	|								ТОГДА Исполнители.Обработчик <> ЗНАЧЕНИЕ(Справочник.кбп_ОбработчикиПроцессов.ПустаяСсылка)
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьИсполнители
	|ИЗ
	|	Справочник.кбп_ЭлементыСхем КАК Элементы
	|ГДЕ
	|	Элементы.Владелец = &Версия
	|	И НЕ Элементы.ПометкаУдаления
	|	И НЕ Элементы.НетНаСхеме
	|
	|УПОРЯДОЧИТЬ ПО
	|	Элементы.ТипШага,
	|	Элементы.Наименование";
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#Область ПанельСвойств

// Исполнители и кнопки шага для панели свойств конструктора.
//
// Параметры:
//  Шаг - СправочникСсылка.кбп_ЭлементыСхем
//
// Возвращаемое значение:
//  Структура - Исполнители, Кнопки (ТаблицаЗначений) — записи кбп_ИсполнителиШагов и кбп_КнопкиШагов.
//
Функция НастройкиШага(Шаг) Экспорт

	Исполнители = РегистрыСведений.кбп_ИсполнителиШагов.СоздатьНаборЗаписей();
	Исполнители.Отбор.Шаг.Установить(Шаг);
	Исполнители.Прочитать();
	ТаблицаИсполнителей = Исполнители.Выгрузить();
	ТаблицаИсполнителей.Сортировать("НомерЗаписи");

	Кнопки = РегистрыСведений.кбп_КнопкиШагов.СоздатьНаборЗаписей();
	Кнопки.Отбор.Шаг.Установить(Шаг);
	Кнопки.Прочитать();
	ТаблицаКнопок = Кнопки.Выгрузить();
	ТаблицаКнопок.Сортировать("Порядок");

	Возврат Новый Структура("Исполнители, Кнопки", ТаблицаИсполнителей, ТаблицаКнопок);

КонецФункции

// Записывает шаг и его исполнителей и кнопки. Только для черновика.
//
// Параметры:
//  ШагОбъект - СправочникОбъект.кбп_ЭлементыСхем
//  Исполнители - Коллекция - строки с полями кбп_ИсполнителиШагов.
//  Кнопки - Коллекция - строки с полями кбп_КнопкиШагов; пустой ИдКнопки заполняется.
//
Процедура ЗаписатьНастройкиШага(ШагОбъект, Исполнители, Кнопки) Экспорт

	ПроверитьЧерновик(ШагОбъект.Владелец);
	НачатьТранзакцию();
	Попытка
		ШагОбъект.Записать();
		Шаг = ШагОбъект.Ссылка;

		Набор = РегистрыСведений.кбп_ИсполнителиШагов.СоздатьНаборЗаписей();
		Набор.Отбор.Шаг.Установить(Шаг);
		Номер = 0;
		Для Каждого Исполнитель Из Исполнители Цикл
			Если Не ЗначениеЗаполнено(Исполнитель.СпособАдресации) Тогда
				Продолжить;
			КонецЕсли;
			Номер = Номер + 1;
			Запись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Исполнитель);
			Запись.Шаг = Шаг;
			Запись.НомерЗаписи = Номер;
		КонецЦикла;
		Набор.Записать();

		// Условия видимости кнопок редактируются отдельно (РедакторУсловия) и при записи таблицы кнопок сохраняются.
		Прежние = РегистрыСведений.кбп_КнопкиШагов.СоздатьНаборЗаписей();
		Прежние.Отбор.Шаг.Установить(Шаг);
		Прежние.Прочитать();
		УсловияВидимости = Новый Соответствие;
		УсловияДоступности = Новый Соответствие;
		Для Каждого Прежняя Из Прежние Цикл
			УсловияВидимости.Вставить(Прежняя.ИдКнопки, Прежняя.УсловиеВидимости);
			УсловияДоступности.Вставить(Прежняя.ИдКнопки, Прежняя.УсловиеДоступности);
		КонецЦикла;

		Набор = РегистрыСведений.кбп_КнопкиШагов.СоздатьНаборЗаписей();
		Набор.Отбор.Шаг.Установить(Шаг);
		Занятые = Новый Соответствие;
		Номер = 0;
		Для Каждого Кнопка Из Кнопки Цикл
			Если Не ЗначениеЗаполнено(Кнопка.Заголовок) Тогда
				Продолжить;
			КонецЕсли;
			Номер = Номер + 1;
			Запись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Кнопка);
			Запись.Шаг = Шаг;
			Запись.Порядок = Номер;
			Если Не ЗначениеЗаполнено(Запись.ИдКнопки) Или Занятые[Запись.ИдКнопки] <> Неопределено Тогда
				Запись.ИдКнопки = "кн" + Лев(СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", ""), 16);
			КонецЕсли;
			Занятые.Вставить(Запись.ИдКнопки, Истина);
			Если УсловияВидимости[Запись.ИдКнопки] <> Неопределено Тогда
				Запись.УсловиеВидимости = УсловияВидимости[Запись.ИдКнопки];
			КонецЕсли;
			Если УсловияДоступности[Запись.ИдКнопки] <> Неопределено Тогда
				Запись.УсловиеДоступности = УсловияДоступности[Запись.ИдКнопки];
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Запись.Вид) Тогда
				Запись.Вид = Перечисления.кбп_ВидыКнопок.Обычная;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Запись.Действие) Тогда
				Запись.Действие = ?(ЗначениеЗаполнено(Запись.ИдПерехода),
					Перечисления.кбп_ВидыДействий.Переход, Перечисления.кбп_ВидыДействий.Завершить);
			КонецЕсли;
		КонецЦикла;
		Набор.Записать();

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Свойства соединительной линии для панели свойств.
//
// Параметры:
//  Версия - СправочникСсылка.кбп_ВерсииСхем
//  ИдПерехода - Строка
//
// Возвращаемое значение:
//  Структура, Неопределено - поля записи кбп_ПереходыСхем.
//
Функция СвойстваПерехода(Версия, ИдПерехода) Экспорт

	Запись = РегистрыСведений.кбп_ПереходыСхем.СоздатьМенеджерЗаписи();
	Запись.Версия = Версия;
	Запись.ИдПерехода = ИдПерехода;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Свойства = Новый Структура(ПоляПерехода());
	ЗаполнитьЗначенияСвойств(Свойства, Запись);
	Свойства.Вставить("Откуда", Запись.Откуда);
	Свойства.Вставить("Куда", Запись.Куда);
	Свойства.Вставить("ТекстУсловия", кбп_Условия.ПредставлениеУсловия(Запись.Условие));
	Возврат Свойства;

КонецФункции

// Условие видимости (ФТ-501) или доступности (ФТ-204) кнопки шага для редактора условия.
//
// Параметры:
//  Шаг - СправочникСсылка.кбп_ЭлементыСхем
//  ИдКнопки - Строка
//  ИмяУсловия - Строка - «УсловиеВидимости» или «УсловиеДоступности».
//
// Возвращаемое значение:
//  НастройкиКомпоновкиДанных, Неопределено
//
Функция УсловиеВидимостиКнопки(Шаг, ИдКнопки, ИмяУсловия = "УсловиеВидимости") Экспорт

	Запись = РегистрыСведений.кбп_КнопкиШагов.СоздатьМенеджерЗаписи();
	Запись.Шаг = Шаг;
	Запись.ИдКнопки = ИдКнопки;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Настройки = Запись[ИмяУсловия].Получить();
	Возврат ?(ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных"), Настройки, Неопределено);

КонецФункции

// Записывает условие видимости или доступности кнопки шага.
//
// Параметры:
//  Шаг - СправочникСсылка.кбп_ЭлементыСхем
//  ИдКнопки - Строка
//  Настройки - НастройкиКомпоновкиДанных, Неопределено
//  ИмяУсловия - Строка - «УсловиеВидимости» или «УсловиеДоступности».
//
Процедура ЗаписатьУсловиеВидимостиКнопки(Шаг, ИдКнопки, Настройки, ИмяУсловия = "УсловиеВидимости") Экспорт

	ПроверитьЧерновик(Шаг.Владелец);
	Запись = РегистрыСведений.кбп_КнопкиШагов.СоздатьМенеджерЗаписи();
	Запись.Шаг = Шаг;
	Запись.ИдКнопки = ИдКнопки;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		ВызватьИсключение НСтр("ru = 'Кнопка не найдена. Запишите свойства шага.'");
	КонецЕсли;
	Запись[ИмяУсловия] = Новый ХранилищеЗначения(Настройки);
	Запись.Записать();

КонецПроцедуры

// Условие-отбор линии для редактора условия.
//
// Параметры:
//  Версия - СправочникСсылка.кбп_ВерсииСхем
//  ИдПерехода - Строка
//
// Возвращаемое значение:
//  НастройкиКомпоновкиДанных, Неопределено
//
Функция УсловиеПерехода(Версия, ИдПерехода) Экспорт

	Запись = РегистрыСведений.кбп_ПереходыСхем.СоздатьМенеджерЗаписи();
	Запись.Версия = Версия;
	Запись.ИдПерехода = ИдПерехода;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Настройки = Запись.Условие.Получить();
	Возврат ?(ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных"), Настройки, Неопределено);

КонецФункции

// Записывает условие-отбор линии и ставит линии вид условия «Отбор».
//
// Параметры:
//  Версия - СправочникСсылка.кбп_ВерсииСхем
//  ИдПерехода - Строка
//  Настройки - НастройкиКомпоновкиДанных, Неопределено - Неопределено очищает условие.
//
Процедура ЗаписатьУсловиеПерехода(Версия, ИдПерехода, Настройки) Экспорт

	ПроверитьЧерновик(Версия);
	Запись = РегистрыСведений.кбп_ПереходыСхем.СоздатьМенеджерЗаписи();
	Запись.Версия = Версия;
	Запись.ИдПерехода = ИдПерехода;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		ВызватьИсключение НСтр("ru = 'Линия не найдена. Сохраните схему.'");
	КонецЕсли;
	Запись.Условие = Новый ХранилищеЗначения(Настройки);
	Если кбп_Условия.УсловиеЗаполнено(Настройки) Тогда
		Запись.ВидУсловия = Перечисления.кбп_ВидыУсловий.Отбор;
	ИначеЕсли Запись.ВидУсловия = Перечисления.кбп_ВидыУсловий.Отбор Тогда
		Запись.ВидУсловия = Перечисления.кбп_ВидыУсловий.Нет;
	КонецЕсли;
	Запись.Записать();

КонецПроцедуры

// Записывает настраиваемые свойства линии. «По умолчанию» у других линий того же шага снимается.
//
// Параметры:
//  Версия - СправочникСсылка.кбп_ВерсииСхем
//  ИдПерехода - Строка
//  Свойства - Структура - см. ПоляПерехода.
//
Процедура ЗаписатьСвойстваПерехода(Версия, ИдПерехода, Свойства) Экспорт

	ПроверитьЧерновик(Версия);
	Набор = РегистрыСведений.кбп_ПереходыСхем.СоздатьНаборЗаписей();
	Набор.Отбор.Версия.Установить(Версия);
	Набор.Прочитать();
	Текущая = Неопределено;
	Для Каждого Запись Из Набор Цикл
		Если Запись.ИдПерехода = ИдПерехода Тогда
			Текущая = Запись;
		КонецЕсли;
	КонецЦикла;
	Если Текущая = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Линия не найдена. Сохраните схему.'");
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Текущая, Свойства, ПоляПерехода());
	Если Текущая.ПоУмолчанию Тогда
		Для Каждого Запись Из Набор Цикл
			Если Запись.ИдПерехода <> ИдПерехода И Запись.Откуда = Текущая.Откуда Тогда
				Запись.ПоУмолчанию = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Набор.Записать();

КонецПроцедуры

// Настраиваемые поля линии.
//
// Возвращаемое значение:
//  Строка - имена через запятую.
//
Функция ПоляПерехода() Экспорт
	Возврат "Порядок, ПоУмолчанию, ЭтоВозврат, ВидУсловия, ОбработчикУсловия, ИдКнопки, Наименование";
КонецФункции

// Исходящие линии шага для выбора перехода кнопки.
//
// Параметры:
//  Шаг - СправочникСсылка.кбп_ЭлементыСхем
//
// Возвращаемое значение:
//  СписокЗначений - значение: ИдПерехода, представление: «→ Куда (подпись)».
//
Функция ВыходыДляВыбора(Шаг) Экспорт

	Результат = Новый СписокЗначений;
	Для Каждого Выход Из кбп_Движок.ВыходыШага(Шаг) Цикл
		Представление = "→ " + Выход.Куда;
		Если ЗначениеЗаполнено(Выход.Наименование) Тогда
			Представление = Представление + " (" + Выход.Наименование + ")";
		КонецЕсли;
		Результат.Добавить(Выход.ИдПерехода, Представление);
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Шаги и линии версии для списка рядом со схемой (в веб-клиенте — единственный способ выбрать элемент).
//
// Параметры:
//  Версия - СправочникСсылка.кбп_ВерсииСхем
//
// Возвращаемое значение:
//  ТаблицаЗначений - Ссылка, ИдЭлемента, Наименование, ТипШага, Вид, ЭтоЛиния.
//
Функция ЭлементыДляСписка(Версия) Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Ссылка");
	Результат.Колонки.Добавить("ИдЭлемента");
	Результат.Колонки.Добавить("Наименование");
	Результат.Колонки.Добавить("ТипШага");
	Результат.Колонки.Добавить("Вид");
	Результат.Колонки.Добавить("ЭтоЛиния");
	Для Каждого Шаг Из ШагиВерсии(Версия) Цикл
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Шаг);
		НоваяСтрока.Вид = Строка(Шаг.ТипШага);
		НоваяСтрока.ЭтоЛиния = Ложь;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Переходы.ИдПерехода КАК ИдПерехода,
	|	Переходы.Откуда КАК Откуда,
	|	Переходы.Куда КАК Куда,
	|	Переходы.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.кбп_ПереходыСхем КАК Переходы
	|ГДЕ
	|	Переходы.Версия = &Версия
	|
	|УПОРЯДОЧИТЬ ПО
	|	Переходы.Порядок";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.ИдЭлемента = Выборка.ИдПерехода;
		НоваяСтрока.Наименование = СтрШаблон("%1 → %2", Выборка.Откуда, Выборка.Куда);
		Если ЗначениеЗаполнено(Выборка.Наименование) Тогда
			НоваяСтрока.Наименование = НоваяСтрока.Наименование + " (" + Выборка.Наименование + ")";
		КонецЕсли;
		НоваяСтрока.Вид = НСтр("ru = 'Линия'");
		НоваяСтрока.ЭтоЛиния = Истина;
	КонецЦикла;
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РазборСхемы

// Вид элемента схемы: "Старт", "Завершение", "Задача", "Условие", "ВыборВарианта", "Разделение",
// "Слияние", "Обработка", "ВложенныйПроцесс", "Линия", "Декорация" или "" для неизвестного.
Функция ВидЭлемента(Элемент)

	Вид = ВидыЭлементовСхемы()[ТипЗнч(Элемент)];
	Возврат ?(Вид = Неопределено, "", Вид);

КонецФункции

// Соответствие типов элементов ГрафическойСхемы видам элементов. Имена типов, отсутствующие
// в версии платформы, пропускаются.
Функция ВидыЭлементовСхемы()

	Имена = Новый Соответствие;
	Имена.Вставить("ЭлементГрафическойСхемыСтарт", "Старт");
	Имена.Вставить("ЭлементГрафическойСхемыЗавершение", "Завершение");
	Имена.Вставить("ЭлементГрафическойСхемыДействие", "Задача");
	Имена.Вставить("ЭлементГрафическойСхемыУсловие", "Условие");
	Имена.Вставить("ЭлементГрафическойСхемыВыборВарианта", "ВыборВарианта");
	Имена.Вставить("ЭлементГрафическойСхемыРазделение", "Разделение");
	Имена.Вставить("ЭлементГрафическойСхемыСлияние", "Слияние");
	Имена.Вставить("ЭлементГрафическойСхемыОбработка", "Обработка");
	Имена.Вставить("ЭлементГрафическойСхемыВложенныйБизнесПроцесс", "ВложенныйПроцесс");
	Имена.Вставить("ЭлементГрафическойСхемыСоединительнаяЛиния", "Линия");
	Имена.Вставить("ЭлементГрафическойСхемыДекорация", "Декорация");
	Имена.Вставить("ЭлементГрафическойСхемыДекоративнаяЛиния", "Декорация");

	Виды = Новый Соответствие;
	Для Каждого КлючЗначение Из Имена Цикл
		Попытка
			Виды.Вставить(Тип(КлючЗначение.Ключ), КлючЗначение.Значение);
		Исключение
			// Тип отсутствует в этой версии платформы.
		КонецПопытки;
	КонецЦикла;
	Возврат Виды;

КонецФункции

Функция ВариантыВыбора(ЭлементВыбора)

	Варианты = Новый Массив;
	Попытка
		Для Каждого Вариант Из ЭлементВыбора.Элементы Цикл
			Варианты.Добавить(Вариант);
		КонецЦикла;
	Исключение
		// Коллекция вариантов недоступна — вернём пустой список, ошибка будет видна при проверке.
	КонецПопытки;
	Возврат Варианты;

КонецФункции

Функция ОписаниеПерехода(Линия, Ошибки)

	// Свойства читаются через ЗаполнитьЗначенияСвойств: отсутствующие в версии платформы просто не заполнятся.
	Свойства = Новый Структура("НачалоЭлемент, КонецЭлемент, НачалоВариант, КонецВариант");
	ЗаполнитьЗначенияСвойств(Свойства, Линия);

	Переход = Новый Структура("Ид, Наименование, ИдОткуда, ИдКуда, ИдВарианта, ВыходУсловия",
		Линия.Имя, Строка(Линия.Наименование), "", "", "", Неопределено);

	Если Свойства.НачалоЭлемент <> Неопределено Тогда
		Переход.ИдОткуда = Свойства.НачалоЭлемент.Имя;
		Если ВидЭлемента(Свойства.НачалоЭлемент) = "ВыборВарианта" Тогда
			Если Свойства.НачалоВариант = Неопределено Тогда
				ДобавитьОшибку(Ошибки, Линия.Имя, НСтр("ru = 'Линия выходит из «Выбора варианта», но не из его варианта'"));
			Иначе
				Переход.ИдВарианта = ИдВарианта(Свойства.НачалоЭлемент.Имя, Свойства.НачалоВариант.Значение);
			КонецЕсли;
		ИначеЕсли ТипЗнч(Свойства.НачалоВариант) = Тип("Булево") Тогда
			Переход.ВыходУсловия = Свойства.НачалоВариант;
		КонецЕсли;
	КонецЕсли;
	Если Свойства.КонецЭлемент <> Неопределено Тогда
		Переход.ИдКуда = Свойства.КонецЭлемент.Имя;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Переход.ИдОткуда) Или Не ЗначениеЗаполнено(Переход.ИдКуда) Тогда
		ДобавитьОшибку(Ошибки, Линия.Имя, НСтр("ru = 'Линия не присоединена к элементам схемы с обеих сторон'"));
	КонецЕсли;
	Возврат Переход;

КонецФункции

Функция НовыйШаг(Ид, Наименование, Вид)
	Возврат Новый Структура("Ид, Наименование, Вид, ИдВыбора, ЗначениеВарианта", Ид, Наименование, Вид, "", "");
КонецФункции

Функция ЭтоИдентификаторЭлемента(Имя)

	Если СтрДлина(Имя) <> 34 Или Лев(Имя, 2) <> "ид" Тогда
		Возврат Ложь;
	КонецЕсли;
	Для Позиция = 3 По 34 Цикл
		Если СтрНайти("0123456789abcdef", Сред(Имя, Позиция, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;

КонецФункции

Функция НовыйИдентификаторЭлемента()
	Возврат "ид" + НРег(СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", ""));
КонецФункции

// У вариантов «Выбора варианта» нет своего имени: идентификатор вычисляется из имени выбора и значения варианта.
Функция ИдВарианта(ИмяВыбора, ЗначениеВарианта)

	Хеширование = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеширование.Добавить(ИмяВыбора + "|" + Строка(ЗначениеВарианта));
	Возврат "ва" + НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеширование.ХешСумма));

КонецФункции

Процедура ДобавитьОшибку(Ошибки, Ид, Текст)
	Ошибки.Добавить(Новый Структура("Ид, Текст", Ид, Текст));
КонецПроцедуры

#КонецОбласти

#Область Синхронизация

Функция ТипШагаПоВиду(Вид)
	Возврат Перечисления.кбп_ТипыШагов[Вид];
КонецФункции

// Создаёт и обновляет элементы справочника по шагам модели; отсутствующие на схеме помечает.
// Возвращает соответствие Ид → Ссылка для шагов, которые есть на схеме.
Функция СинхронизироватьЭлементы(Версия, ШагиМодели)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Элементы.Ссылка КАК Ссылка,
	|	Элементы.ИдЭлемента КАК ИдЭлемента
	|ИЗ
	|	Справочник.кбп_ЭлементыСхем КАК Элементы
	|ГДЕ
	|	Элементы.Владелец = &Версия";
	Существующие = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Существующие.Вставить(Выборка.ИдЭлемента, Выборка.Ссылка);
	КонецЦикла;

	Типы = Перечисления.кбп_ТипыШагов;
	ВидыОбработки = Новый Массив;
	ВидыОбработки.Добавить(Типы.Обработка);
	ВидыОбработки.Добавить(Типы.Таймер);
	ВидыОбработки.Добавить(Типы.Оповещение);

	ЭлементыПоИд = Новый Соответствие;
	// Два прохода: сначала шаги, потом варианты (им нужна ссылка на «Выбор варианта»).
	Для Проход = 1 По 2 Цикл
		Для Каждого Шаг Из ШагиМодели Цикл
			ЭтоВариант = (Шаг.Вид = "Вариант");
			Если ЭтоВариант <> (Проход = 2) Тогда
				Продолжить;
			КонецЕсли;

			Ссылка = Существующие[Шаг.Ид];
			Если Ссылка = Неопределено Тогда
				Объект = Справочники.кбп_ЭлементыСхем.СоздатьЭлемент();
				Объект.Владелец = Версия;
				Объект.ИдЭлемента = Шаг.Ид;
			Иначе
				Объект = Ссылка.ПолучитьОбъект();
			КонецЕсли;

			ТипШага = ТипШагаПоВиду(Шаг.Вид);
			// «Таймер» и «Оповещение» рисуются элементом «Обработка»: выбранный в свойствах тип сохраняется.
			Если Не (ТипШага = Типы.Обработка И ВидыОбработки.Найти(Объект.ТипШага) <> Неопределено) Тогда
				УстановитьЗначение(Объект, "ТипШага", ТипШага);
			КонецЕсли;
			УстановитьЗначение(Объект, "Наименование", Лев(Шаг.Наименование, 150));
			УстановитьЗначение(Объект, "НетНаСхеме", Ложь);
			Если ЭтоВариант Тогда
				УстановитьЗначение(Объект, "ЭлементВыбора", ЭлементыПоИд[Шаг.ИдВыбора]);
				УстановитьЗначение(Объект, "ЗначениеВарианта", Лев(Шаг.ЗначениеВарианта, 150));
			КонецЕсли;
			Если Объект.ПометкаУдаления Тогда
				Объект.ПометкаУдаления = Ложь;
			КонецЕсли;
			Если Объект.ЭтоНовый() Или Объект.Модифицированность() Тогда
				Объект.Записать();
			КонецЕсли;
			ЭлементыПоИд.Вставить(Шаг.Ид, Объект.Ссылка);
		КонецЦикла;
	КонецЦикла;

	// Удалённые со схемы: настройки сохраняются (элемент можно вернуть отменой правки), но шаг исключается из модели.
	Для Каждого КлючЗначение Из Существующие Цикл
		Если ЭлементыПоИд[КлючЗначение.Ключ] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Объект = КлючЗначение.Значение.ПолучитьОбъект();
		Если Не Объект.НетНаСхеме Или Не Объект.ПометкаУдаления Тогда
			Объект.НетНаСхеме = Истина;
			Объект.ПометкаУдаления = Истина;
			Объект.Записать();
		КонецЕсли;
	КонецЦикла;

	Возврат ЭлементыПоИд;

КонецФункции

Процедура УстановитьЗначение(Объект, Реквизит, Значение)
	Если Объект[Реквизит] <> Значение Тогда
		Объект[Реквизит] = Значение;
	КонецЕсли;
КонецПроцедуры

// Перезаписывает переходы версии по линиям схемы. Настройки перехода (условие, «по умолчанию», кнопка, порядок)
// сохраняются по ИдПерехода.
Процедура СинхронизироватьПереходы(Версия, ПереходыМодели, ЭлементыПоИд, Ошибки)

	Набор = РегистрыСведений.кбп_ПереходыСхем.СоздатьНаборЗаписей();
	Набор.Отбор.Версия.Установить(Версия);
	Набор.Прочитать();
	Прежние = Набор.Выгрузить();
	Прежние.Индексы.Добавить("ИдПерехода");
	Набор.Очистить();

	Порядок = 0;
	Для Каждого Переход Из ПереходыМодели Цикл
		Откуда = ЭлементыПоИд[Переход.ИдОткуда];
		Куда = ЭлементыПоИд[Переход.ИдКуда];
		Если Откуда = Неопределено Или Куда = Неопределено Тогда
			Продолжить; // ошибка уже добавлена при разборе
		КонецЕсли;
		Порядок = Порядок + 1;

		Запись = Набор.Добавить();
		Прежняя = Прежние.Найти(Переход.Ид, "ИдПерехода");
		Если Прежняя = Неопределено Тогда
			Запись.Порядок = Порядок;
			Запись.ВидУсловия = Перечисления.кбп_ВидыУсловий.Нет;
			Если Переход.ВыходУсловия <> Неопределено Тогда
				Запись.ПоУмолчанию = Не Переход.ВыходУсловия;
			КонецЕсли;
		Иначе
			ЗаполнитьЗначенияСвойств(Запись, Прежняя);
		КонецЕсли;
		Запись.Версия = Версия;
		Запись.ИдПерехода = Переход.Ид;
		Запись.Откуда = Откуда;
		Запись.Куда = Куда;
		Запись.Наименование = Лев(Переход.Наименование, 150);
		Если ЗначениеЗаполнено(Переход.ИдВарианта) Тогда
			Запись.Вариант = ЭлементыПоИд[Переход.ИдВарианта];
		Иначе
			Запись.Вариант = Справочники.кбп_ЭлементыСхем.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;

	Набор.Записать();

КонецПроцедуры

#КонецОбласти

#Область Проверка

Функция ПереходыВерсии(Версия)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Переходы.ИдПерехода КАК ИдПерехода,
	|	Переходы.Откуда КАК Откуда,
	|	Переходы.Куда КАК Куда,
	|	Переходы.Вариант КАК Вариант,
	|	Переходы.ПоУмолчанию КАК ПоУмолчанию,
	|	Переходы.ВидУсловия КАК ВидУсловия,
	|	Переходы.ОбработчикУсловия КАК ОбработчикУсловия,
	|	Переходы.Условие КАК Условие,
	|	Переходы.ИдКнопки КАК ИдКнопки,
	|	Переходы.ЭтоВозврат КАК ЭтоВозврат,
	|	Переходы.Наименование КАК Наименование,
	|	ЕСТЬNULL(Переходы.Вариант.Наименование, """") КАК НаименованиеВарианта
	|ИЗ
	|	РегистрСведений.кбп_ПереходыСхем КАК Переходы
	|ГДЕ
	|	Переходы.Версия = &Версия
	|
	|УПОРЯДОЧИТЬ ПО
	|	Переходы.Порядок";
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// У Условия две ветки: одна «по умолчанию» (ветка «Нет»), у другой задано условие —
// результат задачи (кнопка, или подпись линии совпадает с кнопкой), обработчик или отбор.
Процедура ПроверитьУсловие(Шаг, Переходы, Ошибки, ЗаголовкиКнопок)

	Выходы = Переходы.НайтиСтроки(Новый Структура("Откуда", Шаг.Ссылка));
	Если Выходы.Количество() <> 2 Тогда
		ДобавитьОшибку(Ошибки, Шаг.ИдЭлемента, СтрШаблон(
			НСтр("ru = '«%1»: у Условия должно быть ровно две ветки (сейчас %2)'"), Шаг.Наименование, Выходы.Количество()));
		Возврат;
	КонецЕсли;
	ЧислоПоУмолчанию = 0;
	Для Каждого Выход Из Выходы Цикл
		Если Выход.ПоУмолчанию Тогда
			ЧислоПоУмолчанию = ЧислоПоУмолчанию + 1;
		ИначеЕсли Не ЛинияСУсловием(Выход, ЗаголовкиКнопок) Тогда
			ДобавитьОшибку(Ошибки, Выход.ИдПерехода, СтрШаблон(
				НСтр("ru = '«%1»: у ветки «Да» задайте условие — результат задачи, условие-отбор или обработчик'"),
				Шаг.Наименование));
		КонецЕсли;
	КонецЦикла;
	Если ЧислоПоУмолчанию <> 1 Тогда
		ДобавитьОшибку(Ошибки, Шаг.ИдЭлемента, СтрШаблон(
			НСтр("ru = '«%1»: отметьте у одной из двух линий Условия признак «По умолчанию» (ветка «Нет»)'"),
			Шаг.Наименование));
	КонецЕсли;

КонецПроцедуры

// Выбор варианта: у каждой ветки есть условие (кнопка, совпадение подписи или названия варианта с кнопкой,
// отбор, обработчик) или она «по умолчанию»; «по умолчанию» — не больше одной.
Процедура ПроверитьВыборВарианта(Шаг, Переходы, Ошибки, ЗаголовкиКнопок)

	Выходы = Переходы.НайтиСтроки(Новый Структура("Откуда", Шаг.Ссылка));
	ЧислоПоУмолчанию = 0;
	Для Каждого Выход Из Выходы Цикл
		Если Выход.ПоУмолчанию Тогда
			ЧислоПоУмолчанию = ЧислоПоУмолчанию + 1;
		ИначеЕсли Не ЛинияСУсловием(Выход, ЗаголовкиКнопок) Тогда
			ДобавитьОшибку(Ошибки, Выход.ИдПерехода, СтрШаблон(
				НСтр("ru = '«%1»: для варианта «%2» задайте условие или назовите вариант так же, как кнопку задачи'"),
				Шаг.Наименование, ?(ЗначениеЗаполнено(Выход.НаименованиеВарианта), Выход.НаименованиеВарианта, Выход.Куда)));
		КонецЕсли;
	КонецЦикла;
	Если ЧислоПоУмолчанию > 1 Тогда
		ДобавитьОшибку(Ошибки, Шаг.ИдЭлемента, СтрШаблон(
			НСтр("ru = '«%1»: признак «По умолчанию» может быть только у одного варианта'"), Шаг.Наименование));
	КонецЕсли;

КонецПроцедуры

// Кнопки с действиями «Открыть форму» и «Запустить вложенный процесс» требуют параметров (ФТ-502).
Процедура ПроверитьКнопки(Шаг, Ошибки)

	Действия = Перечисления.кбп_ВидыДействий;
	Для Каждого Кнопка Из кбп_Действия.КнопкиШага(Шаг.Ссылка) Цикл
		Если Кнопка.Действие = Действия.ОткрытьФорму И Не ЗначениеЗаполнено(Кнопка.ИмяФормы) Тогда
			ДобавитьОшибку(Ошибки, Шаг.ИдЭлемента, СтрШаблон(
				НСтр("ru = '«%1»: у кнопки «%2» не указано имя формы или отчёта'"), Шаг.Наименование, Кнопка.Заголовок));
		ИначеЕсли Кнопка.Действие = Действия.ЗапуститьВложенный И Не ЗначениеЗаполнено(Кнопка.ВложеннаяСхема) Тогда
			ДобавитьОшибку(Ошибки, Шаг.ИдЭлемента, СтрШаблон(
				НСтр("ru = '«%1»: у кнопки «%2» не указана схема запускаемого процесса'"), Шаг.Наименование, Кнопка.Заголовок));
		ИначеЕсли Кнопка.Действие = Действия.Обработчик И Не ЗначениеЗаполнено(Кнопка.Обработчик) Тогда
			ДобавитьОшибку(Ошибки, Шаг.ИдЭлемента, СтрШаблон(
				НСтр("ru = '«%1»: у кнопки «%2» не выбран обработчик'"), Шаг.Наименование, Кнопка.Заголовок));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ЛинияСУсловием(Выход, ЗаголовкиКнопок)

	ВидыУсловий = Перечисления.кбп_ВидыУсловий;
	Если ЗначениеЗаполнено(Выход.ИдКнопки) Тогда
		Возврат Истина;
	ИначеЕсли Выход.ВидУсловия = ВидыУсловий.Обработчик Или Выход.ВидУсловия = ВидыУсловий.Отбор Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ЗаголовкиКнопок[НРег(СокрЛП(Выход.Наименование))] <> Неопределено
		Или ЗаголовкиКнопок[НРег(СокрЛП(Выход.НаименованиеВарианта))] <> Неопределено;

КонецФункции

// Заголовки кнопок задач версии в нижнем регистре — для веток, выбираемых по совпадению с нажатой кнопкой.
Функция ЗаголовкиКнопокВерсии(Версия)

	Результат = Новый Соответствие;
	Для Каждого Кнопка Из кбп_Действия.КнопкиВерсии(Версия) Цикл
		Части = СтрРазделить(Кнопка.Представление, ":");
		Результат.Вставить(НРег(СокрЛП(Части[Части.ВГраница()])), Истина);
	КонецЦикла;
	Результат.Удалить("");
	Возврат Результат;

КонецФункции

// Ветки разделения должны сойтись в одном Слиянии, не доходя до Завершения (ФТ-105).
// Обход идёт по линиям без признака «Это возврат»; вложенные разделения учитываются счётчиком глубины.
Процедура ПроверитьПарностьРазделения(Шаг, Узлы, Исходящие, Ошибки)

	Типы = Перечисления.кбп_ТипыШагов;
	Слияния = Новый Соответствие;
	ДоЗавершения = Ложь;
	Посещенные = Новый Соответствие;
	Стек = Новый Массив;
	Для Каждого Следующий Из Исходящие[Шаг.Ссылка] Цикл
		Стек.Добавить(Новый Структура("Узел, Глубина", Следующий, 0));
	КонецЦикла;
	Пока Стек.Количество() > 0 Цикл
		Текущий = Стек[Стек.ВГраница()];
		Стек.Удалить(Стек.ВГраница());
		Ключ = Строка(Текущий.Узел.УникальныйИдентификатор()) + "/" + Текущий.Глубина;
		Если Посещенные[Ключ] <> Неопределено Или Текущий.Глубина > 50 Тогда
			Продолжить;
		КонецЕсли;
		Посещенные.Вставить(Ключ, Истина);
		Узел = Узлы[Текущий.Узел];
		Если Узел = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Глубина = Текущий.Глубина;
		Если Узел.ТипШага = Типы.Слияние Тогда
			Если Глубина = 0 Тогда
				Слияния.Вставить(Текущий.Узел, Истина);
				Продолжить;
			КонецЕсли;
			Глубина = Глубина - 1;
		ИначеЕсли Узел.ТипШага = Типы.Разделение Тогда
			Глубина = Глубина + 1;
		ИначеЕсли Узел.ТипШага = Типы.Завершение Тогда
			ДоЗавершения = Истина;
			Продолжить;
		КонецЕсли;
		Соседи = Исходящие[Текущий.Узел];
		Если Соседи <> Неопределено Тогда
			Для Каждого Следующий Из Соседи Цикл
				Стек.Добавить(Новый Структура("Узел, Глубина", Следующий, Глубина));
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Если ДоЗавершения Тогда
		ДобавитьОшибку(Ошибки, Шаг.ИдЭлемента, СтрШаблон(
			НСтр("ru = '«%1»: ветка разделения доходит до Завершения, минуя Слияние. Сведите все ветки в Слияние (линии возврата отметьте «Это возврат»)'"),
			Шаг.Наименование));
	ИначеЕсли Слияния.Количество() = 0 Тогда
		ДобавитьОшибку(Ошибки, Шаг.ИдЭлемента, СтрШаблон(
			НСтр("ru = '«%1»: для Разделения нет парного Слияния'"), Шаг.Наименование));
	ИначеЕсли Слияния.Количество() > 1 Тогда
		ДобавитьОшибку(Ошибки, Шаг.ИдЭлемента, СтрШаблон(
			НСтр("ru = '«%1»: ветки разделения сходятся в разных Слияниях — сведите их в одно'"), Шаг.Наименование));
	КонецЕсли;

КонецПроцедуры

// Вложенная схема указана и опубликована, и не вызывает (через другие схемы) схему этой версии (ФТ-705).
Процедура ПроверитьВложенныйПроцесс(Шаг, Версия, Ошибки)

	Имя = Шаг.Наименование;
	Если Не ЗначениеЗаполнено(Шаг.ВложеннаяСхема) Тогда
		ДобавитьОшибку(Ошибки, Шаг.ИдЭлемента, СтрШаблон(НСтр("ru = '«%1»: не указана вложенная схема'"), Имя));
		Возврат;
	КонецЕсли;
	Если Шаг.МножественныйЗапуск И Не ЗначениеЗаполнено(Шаг.ИсточникМножественногоЗапуска) Тогда
		ДобавитьОшибку(Ошибки, Шаг.ИдЭлемента, СтрШаблон(
			НСтр("ru = '«%1»: для множественного запуска укажите, по каким элементам (например, «Товары.Подразделение»)'"), Имя));
	ИначеЕсли Шаг.МножественныйЗапуск И Шаг.РежимСлияния = Перечисления.кбп_РежимыСлияния.NизM
		И Шаг.КоличествоДляСлияния < 1 Тогда
		ДобавитьОшибку(Ошибки, Шаг.ИдЭлемента, СтрШаблон(
			НСтр("ru = '«%1»: для режима «N из M» укажите N'"), Имя));
	КонецЕсли;
	ВерсияДочерней = ?(ЗначениеЗаполнено(Шаг.ВложеннаяВерсия), Шаг.ВложеннаяВерсия, Шаг.ВложеннаяСхема.ТекущаяВерсия);
	Если Не ЗначениеЗаполнено(ВерсияДочерней) Тогда
		ДобавитьОшибку(Ошибки, Шаг.ИдЭлемента, СтрШаблон(
			НСтр("ru = '«%1»: у схемы «%2» нет опубликованной версии'"), Имя, Шаг.ВложеннаяСхема));
		Возврат;
	КонецЕсли;

	Схема = Версия.Владелец;
	Цепочка = Новый Массив;
	Если ЕстьВызовСхемы(ВерсияДочерней, Схема, Новый Соответствие, Цепочка) Тогда
		ДобавитьОшибку(Ошибки, Шаг.ИдЭлемента, СтрШаблон(
			НСтр("ru = '«%1»: схема «%2» вызывает саму себя: %3'"), Имя, Схема,
			СтрСоединить(Цепочка, " → ")));
	КонецЕсли;

КонецПроцедуры

// Обход графа «версия → вложенные схемы (их текущие версии)» в глубину.
Функция ЕстьВызовСхемы(Версия, ИскомаяСхема, Посещенные, Цепочка)

	Если Посещенные[Версия] <> Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Посещенные.Вставить(Версия, Истина);
	Цепочка.Добавить(Строка(Версия.Владелец));
	Если Версия.Владелец = ИскомаяСхема Тогда
		Возврат Истина;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("ВложенныйПроцесс", Перечисления.кбп_ТипыШагов.ВложенныйПроцесс);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА Элементы.ВложеннаяВерсия <> ЗНАЧЕНИЕ(Справочник.кбп_ВерсииСхем.ПустаяСсылка)
	|			ТОГДА Элементы.ВложеннаяВерсия
	|		ИНАЧЕ Элементы.ВложеннаяСхема.ТекущаяВерсия
	|	КОНЕЦ КАК Версия
	|ИЗ
	|	Справочник.кбп_ЭлементыСхем КАК Элементы
	|ГДЕ
	|	Элементы.Владелец = &Версия
	|	И Элементы.ТипШага = &ВложенныйПроцесс
	|	И НЕ Элементы.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Версия) И ЕстьВызовСхемы(Выборка.Версия, ИскомаяСхема, Посещенные, Цепочка) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Цепочка.Удалить(Цепочка.ВГраница());
	Возврат Ложь;

КонецФункции

// Если из задачи несколько линий и кнопки настроены вручную, каждая линия должна быть привязана к кнопке,
// иметь условие или быть «по умолчанию». Без настроенных кнопок каждая линия сама становится кнопкой.
Процедура ПроверитьВыходыПоКнопкам(Шаг, Переходы, Ошибки)

	Набор = РегистрыСведений.кбп_КнопкиШагов.СоздатьНаборЗаписей();
	Набор.Отбор.Шаг.Установить(Шаг.Ссылка);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ПереходыКнопок = Набор.Выгрузить().ВыгрузитьКолонку("ИдПерехода");

	БезКнопки = 0;
	Для Каждого Выход Из Переходы.НайтиСтроки(Новый Структура("Откуда", Шаг.Ссылка)) Цикл
		Если Не ЗначениеЗаполнено(Выход.ИдКнопки) И Не Выход.ПоУмолчанию
			И ПереходыКнопок.Найти(Выход.ИдПерехода) = Неопределено
			И Выход.ВидУсловия <> Перечисления.кбп_ВидыУсловий.Обработчик
			И Выход.ВидУсловия <> Перечисления.кбп_ВидыУсловий.Отбор Тогда
			БезКнопки = БезКнопки + 1;
		КонецЕсли;
	КонецЦикла;
	Если БезКнопки > 0 Тогда
		ДобавитьОшибку(Ошибки, Шаг.ИдЭлемента, СтрШаблон(
			НСтр("ru = '«%1»: из задачи выходит несколько линий — привяжите каждую к кнопке, условию или отметьте «По умолчанию»'"),
			Шаг.Наименование));
	КонецЕсли;

КонецПроцедуры

// Обход графа в ширину от начальных узлов по соответствию смежности. Возвращает множество посещённых узлов.
Функция ОбходГрафа(Начальные, Смежность)

	Посещенные = Новый Соответствие;
	Очередь = Новый Массив;
	Для Каждого Узел Из Начальные Цикл
		Посещенные.Вставить(Узел, Истина);
		Очередь.Добавить(Узел);
	КонецЦикла;
	Индекс = 0;
	Пока Индекс < Очередь.Количество() Цикл
		Соседи = Смежность[Очередь[Индекс]];
		Индекс = Индекс + 1;
		Если Соседи = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Сосед Из Соседи Цикл
			Если Посещенные[Сосед] = Неопределено Тогда
				Посещенные.Вставить(Сосед, Истина);
				Очередь.Добавить(Сосед);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Посещенные;

КонецФункции

#КонецОбласти

#Область Версии

Процедура ПроверитьЧерновик(Версия)

	Если Не ЗначениеЗаполнено(Версия) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана версия схемы.'");
	КонецЕсли;
	Если Версия.Статус <> Перечисления.кбп_СтатусыВерсийСхем.Черновик Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = '%1 уже опубликована и не изменяется. Для правки создайте черновик.'"), Версия);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаблокироватьСхему(Схема)

	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить("Справочник.кбп_СхемыПроцессов").УстановитьЗначение("Ссылка", Схема);
	Блокировка.Заблокировать();

КонецПроцедуры

Функция СледующийНомерВерсии(Схема)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Схема", Схема);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(Версии.НомерВерсии), 0) + 1 КАК Номер
	|ИЗ
	|	Справочник.кбп_ВерсииСхем КАК Версии
	|ГДЕ
	|	Версии.Владелец = &Схема";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Номер;

КонецФункции

// Копирует элементы версии и записи регистров настроек в новую версию с заменой ссылок на элементы.
Процедура КопироватьНастройкиВерсии(Источник, Приемник)

	Замены = Новый Соответствие; // старый элемент → новый
	Копии = Новый Массив;

	Выборка = Справочники.кбп_ЭлементыСхем.Выбрать(, Источник);
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		Копия = Выборка.ПолучитьОбъект().Скопировать();
		Копия.Владелец = Приемник;
		Копия.ОбменДанными.Загрузка = Истина; // ссылки на элементы источника заменяются вторым проходом
		Копия.Записать();
		Замены.Вставить(Выборка.Ссылка, Копия.Ссылка);
		Копии.Добавить(Копия);
	КонецЦикла;

	ТабличныеЧасти = Новый Структура("ШагиВозврата, ЗавершаемыеШаги", "Шаг", "Шаг");
	Для Каждого Копия Из Копии Цикл
		Копия.ЭлементВыбора = Заменить(Копия.ЭлементВыбора, Замены);
		Для Каждого КлючЗначение Из ТабличныеЧасти Цикл
			Для Каждого Строка Из Копия[КлючЗначение.Ключ] Цикл
				Строка[КлючЗначение.Значение] = Заменить(Строка[КлючЗначение.Значение], Замены);
			КонецЦикла;
		КонецЦикла;
		Копия.ОбменДанными.Загрузка = Ложь;
		Копия.Записать();
	КонецЦикла;

	КопироватьЗаписи("кбп_ПереходыСхем", "Версия", Источник, Приемник, "Откуда, Куда, Вариант", Замены);
	КопироватьЗаписи("кбп_ОповещенияШагов", "Версия", Источник, Приемник, "Шаг", Замены);
	Для Каждого КлючЗначение Из Замены Цикл
		КопироватьЗаписи("кбп_КнопкиШагов", "Шаг", КлючЗначение.Ключ, КлючЗначение.Значение, "", Замены);
		КопироватьЗаписи("кбп_ИсполнителиШагов", "Шаг", КлючЗначение.Ключ, КлючЗначение.Значение, "", Замены);
	КонецЦикла;

КонецПроцедуры

Процедура КопироватьЗаписи(ИмяРегистра, ПолеОтбора, Старое, Новое, ПоляСсылок, Замены)

	Менеджер = РегистрыСведений[ИмяРегистра];
	Исходный = Менеджер.СоздатьНаборЗаписей();
	Исходный.Отбор[ПолеОтбора].Установить(Старое);
	Исходный.Прочитать();
	Если Исходный.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Поля = СтрРазделить(ПоляСсылок, ", ", Ложь);
	Набор = Менеджер.СоздатьНаборЗаписей();
	Набор.Отбор[ПолеОтбора].Установить(Новое);
	Для Каждого Исходная Из Исходный Цикл
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Исходная);
		Запись[ПолеОтбора] = Новое;
		Для Каждого Поле Из Поля Цикл
			Запись[Поле] = Заменить(Запись[Поле], Замены);
		КонецЦикла;
	КонецЦикла;
	Набор.Записать();

КонецПроцедуры

Функция Заменить(Значение, Замены)
	Новое = Замены[Значение];
	Возврат ?(Новое = Неопределено, Значение, Новое);
КонецФункции

#КонецОбласти

#КонецОбласти
